#### MacroLanguageType Enumeration

---

|  |
| --- |
| See Also |

The Macro language types.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum MacroLanguageType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MacroLanguageType ``` |

| Visual C++ |
| --- |
| ``` public enum class MacroLanguageType ``` |

# Members

| Member name | Description |
| --- | --- |
| CSharp | The C# language. |
| VBNet | The VB.NET language. |
| Python | The Python language. |

# See Also

Autodesk.Revit.DB.Macros Namespace